MoMoWan/STM32F429I-DISC1/00-Default/Utilities/stm32f4_ili9341_ltdc.c
#include "stm32f4_ili9341_ltdc.h"
#include "stm32f4_fonts.h"

/* Private structures */
/**
 * @brief  Orientation
 * @note   Used private
 */
typedef enum {
	ILI9341_Landscape,
	ILI9341_Portrait
} ILI9341_Orientation;

/**
 * @brief  LCD options
 * @note   For private use only
 */
typedef struct {
	uint16_t Width;
	uint16_t Height;
	ILI9341_Orientation Orientation; // 1 = portrait; 0 = landscape
	uint8_t CurrentLayer;
	uint32_t CurrentLayerOffset;
	uint8_t Layer1Opacity;
	uint8_t Layer2Opacity;
	ILI9341_Orientation_t Orient;
} ILI931_Options_t;

/* Private defines */
/* Pin functions */
#define ILI9341_CS_SET				GPIO_SetPinHigh(ILI9341_CS_PORT, ILI9341_CS_PIN)
#define ILI9341_CS_RESET			GPIO_SetPinLow(ILI9341_CS_PORT, ILI9341_CS_PIN)
#define ILI9341_WRX_SET				GPIO_SetPinHigh(ILI9341_WRX_PORT, ILI9341_WRX_PIN)
#define ILI9341_WRX_RESET			GPIO_SetPinLow(ILI9341_WRX_PORT, ILI9341_WRX_PIN)

/* LCD settings */
#define ILI9341_WIDTH 				240
#define ILI9341_HEIGHT				320
#define ILI9341_PIXEL				76800

/* Starting buffer address in RAM */
/* Offset for Layer 1 = SDRAM START ADDRESS + FRAME_BUFFER */
#define ILI9341_FRAME_BUFFER		SDRAM_START_ADR
/* Offset for Layer 2 */
#define ILI9341_FRAME_OFFSET		(uint32_t)ILI9341_PIXEL * 2

/* Commands */
#define ILI9341_RESET				0x01
#define ILI9341_SLEEP_OUT			0x11
#define ILI9341_GAMMA				0x26
#define ILI9341_DISPLAY_OFF			0x28
#define ILI9341_DISPLAY_ON			0x29
#define ILI9341_COLUMN_ADDR			0x2A
#define ILI9341_PAGE_ADDR			0x2B
#define ILI9341_GRAM				0x2C
#define ILI9341_MAC					0x36
#define ILI9341_PIXEL_FORMAT		0x3A
#define ILI9341_WDB					0x51
#define ILI9341_WCD					0x53
#define ILI9341_RGB_INTERFACE		0xB0
#define ILI9341_FRC					0xB1
#define ILI9341_BPC					0xB5
#define ILI9341_DFC					0xB6
#define ILI9341_POWER1				0xC0
#define ILI9341_POWER2				0xC1
#define ILI9341_VCOM1				0xC5
#define ILI9341_VCOM2				0xC7
#define ILI9341_POWERA				0xCB
#define ILI9341_POWERB				0xCF
#define ILI9341_PGAMMA				0xE0
#define ILI9341_NGAMMA				0xE1
#define ILI9341_DTCA				0xE8
#define ILI9341_DTCB				0xEA
#define ILI9341_POWER_SEQ			0xED
#define ILI9341_3GAMMA_EN			0xF2
#define ILI9341_INTERFACE			0xF6
#define ILI9341_PRC					0xF7

/* Private variables */
uint16_t ILI9341_x;
uint16_t ILI9341_y;
ILI931_Options_t ILI9341_Opts;

/* Private functions */
void INT_ILI9341_DrawCircleCorner(int16_t x0, int16_t y0, int16_t r, uint8_t corner, uint32_t color);
void INT_ILI9341_DrawFilledCircleCorner(int16_t x0, int16_t y0, int16_t r, uint8_t corner, uint32_t color);
void ILI9341_InitPins(void);
void LCD9341_InitLTDC(void);
void ILI9341_InitLayers(void);
void ILI9341_InitLCD(void);
void ILI9341_SendData(uint8_t data);
void ILI9341_SendCommand(uint8_t data);
void ILI9341_Delay(volatile unsigned int delay);
void ILI9341_SetCursorPosition(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2);
void ILI9341_UpdateLayerOpacity(void);

void ILI9341_Init(void) {
	/* Initialize pins used */
	ILI9341_InitPins();
	/* SPI chip select high */
	ILI9341_CS_SET;
	/* Init SPI */
	SPI_Inits(ILI9341_SPI, ILI9341_SPI_PINS);
	/* Init SDRAM */
	SDRAM_Init();
	/* Initialize LCD for LTDC */
	ILI9341_InitLCD();
	/* Initialize LTDC */
	LCD9341_InitLTDC();
	/* Initialize LTDC layers */
	ILI9341_InitLayers();
	/* Set cursor X and Y */
	ILI9341_x = ILI9341_y = 0;
	
	/* Set default settings */
	ILI9341_Opts.Width = ILI9341_WIDTH;
	ILI9341_Opts.Height = ILI9341_HEIGHT;
	ILI9341_Opts.Orientation = ILI9341_Portrait;
	ILI9341_Opts.Orient = ILI9341_Orientation_Portrait_1;
	ILI9341_Opts.CurrentLayer = 0;
	ILI9341_Opts.CurrentLayerOffset = 0;
	ILI9341_Opts.Layer1Opacity = 255;
	ILI9341_Opts.Layer2Opacity = 0;
	
	/* Fill both layers with default colors */
	ILI9341_SetLayer1();
	ILI9341_Fill(ILI9341_COLOR_WHITE);
	ILI9341_SetLayer2();
	ILI9341_Fill(ILI9341_COLOR_WHITE);
	ILI9341_SetLayer1();
}

void ILI9341_InitPins(void) {
	/* Init WRX pin */
	GPIO_Inits(ILI9341_WRX_PORT, ILI9341_WRX_PIN, GPIO_Mode_OUT, GPIO_OType_PP, GPIO_PuPd_NOPULL, GPIO_Medium_Speed);
	
	/* Init CS pin */
	GPIO_Inits(ILI9341_CS_PORT, ILI9341_CS_PIN, GPIO_Mode_OUT, GPIO_OType_PP, GPIO_PuPd_NOPULL, GPIO_Medium_Speed);

	/* GPIOA                     Blue5        VSYNC        Green2       Red4          Red5 */
	GPIO_InitAlternate(GPIOA, GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_6 | GPIO_Pin_11 | GPIO_Pin_12, GPIO_OType_PP, GPIO_PuPd_NOPULL, GPIO_High_Speed, GPIO_AF_LTDC);
	
	/* GPIOB                     Red3         Red6 */
	GPIO_InitAlternate(GPIOB, GPIO_Pin_0 | GPIO_Pin_1, GPIO_OType_PP, GPIO_PuPd_NOPULL, GPIO_High_Speed, 0x09);
	
	/* GPIOB                     Blue6		  Blue7        Green4        Green5 */
	GPIO_InitAlternate(GPIOB, GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11, GPIO_OType_PP, GPIO_PuPd_NOPULL, GPIO_High_Speed, GPIO_AF_LTDC);
	
	/* GPIOC                     HSYNC        Green6       Red2 */
	GPIO_InitAlternate(GPIOC, GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_10, GPIO_OType_PP, GPIO_PuPd_NOPULL, GPIO_High_Speed, GPIO_AF_LTDC);
	
	/* GPIOD                     Green7       Blue2 */
	GPIO_InitAlternate(GPIOD, GPIO_Pin_3 | GPIO_Pin_6 | GPIO_Pin_10, GPIO_OType_PP, GPIO_PuPd_NOPULL, GPIO_High_Speed, GPIO_AF_LTDC);
	
	/* GPIOF                     Enable */
	GPIO_InitAlternate(GPIOF, GPIO_Pin_10, GPIO_OType_PP, GPIO_PuPd_NOPULL, GPIO_High_Speed, GPIO_AF_LTDC);

	/* GPIOG                     Red7         DOTCLK       Blue3 */
	GPIO_InitAlternate(GPIOG, GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_11, GPIO_OType_PP, GPIO_PuPd_NOPULL, GPIO_High_Speed, GPIO_AF_LTDC);

	/* GPIOG                     Green3        Blue4 */
	GPIO_InitAlternate(GPIOG, GPIO_Pin_10 | GPIO_Pin_12, GPIO_OType_PP, GPIO_PuPd_NOPULL, GPIO_High_Speed, 0x09);
}

void ILI9341_InitLCD(void) {	
	ILI9341_SendCommand(0xCA);
	ILI9341_SendData(0xC3);
	ILI9341_SendData(0x08);
	ILI9341_SendData(0x50);
	ILI9341_SendCommand(ILI9341_POWERB);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0xC1);
	ILI9341_SendData(0x30);
	ILI9341_SendCommand(ILI9341_POWER_SEQ);
	ILI9341_SendData(0x64);
	ILI9341_SendData(0x03);
	ILI9341_SendData(0x12);
	ILI9341_SendData(0x81);
	ILI9341_SendCommand(ILI9341_DTCA);
	ILI9341_SendData(0x85);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x78);
	ILI9341_SendCommand(ILI9341_POWERA);
	ILI9341_SendData(0x39);
	ILI9341_SendData(0x2C);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x34);
	ILI9341_SendData(0x02);
	ILI9341_SendCommand(ILI9341_PRC);
	ILI9341_SendData(0x20);
	ILI9341_SendCommand(ILI9341_DTCB);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x00);
	ILI9341_SendCommand(ILI9341_FRC);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x1B);
	ILI9341_SendCommand(ILI9341_DFC);
	ILI9341_SendData(0x0A);
	ILI9341_SendData(0xA2);
	ILI9341_SendCommand(ILI9341_POWER1);
	ILI9341_SendData(0x10);
	ILI9341_SendCommand(ILI9341_POWER2);
	ILI9341_SendData(0x10);
	ILI9341_SendCommand(ILI9341_VCOM1);
	ILI9341_SendData(0x45);
	ILI9341_SendData(0x15);
	ILI9341_SendCommand(ILI9341_VCOM2);
	ILI9341_SendData(0x90);
	ILI9341_SendCommand(ILI9341_MAC);
	ILI9341_SendData(0xC8);
	ILI9341_SendCommand(ILI9341_3GAMMA_EN);
	ILI9341_SendData(0x00);
	ILI9341_SendCommand(ILI9341_RGB_INTERFACE);
	ILI9341_SendData(0xC2);
	ILI9341_SendCommand(ILI9341_DFC);
	ILI9341_SendData(0x0A);
	ILI9341_SendData(0xA7);
	ILI9341_SendData(0x27);
	ILI9341_SendData(0x04);

