MoMoWan/STM32F429I-DISC1/00-Default/Utilities/stm32f4_ili9341_ltdc.c
	/* Configure blending factors */ 
	LTDC_Layer_InitStruct.LTDC_BlendingFactor_1 = LTDC_BlendingFactor1_PAxCA;
	LTDC_Layer_InitStruct.LTDC_BlendingFactor_2 = LTDC_BlendingFactor2_PAxCA;
	/* Initialize Layer 2 */
	LTDC_LayerInit(LTDC_Layer2, &LTDC_Layer_InitStruct);

	LTDC_ReloadConfig(LTDC_IMReload);
	
	/* Enable foreground & background Layers */
	LTDC_LayerCmd(LTDC_Layer1, ENABLE);
	LTDC_LayerCmd(LTDC_Layer2, ENABLE);
	
	/* Reload immediate */
	LTDC_ReloadConfig(LTDC_IMReload);

	LTDC_DitherCmd(ENABLE);
	
	/* Display On */
	LTDC_Cmd(ENABLE);
	
	/* Set opacity */
	LTDC_LayerAlpha(LTDC_Layer1, 255);
	LTDC_LayerAlpha(LTDC_Layer2, 0);
	
	/* Immediate reload */
	LTDC_ReloadConfig(LTDC_IMReload);
}

void ILI9341_SendCommand(uint8_t data) {
	ILI9341_WRX_RESET;
	ILI9341_CS_RESET;
	SPI_Send(ILI9341_SPI, data);
	ILI9341_CS_SET;
}

void ILI9341_SendData(uint8_t data) {
	ILI9341_WRX_SET;
	ILI9341_CS_RESET;
	SPI_Send(ILI9341_SPI, data);
	ILI9341_CS_SET;
}

void ILI9341_DrawPixel(uint16_t x, uint16_t y, uint32_t color) {
	uint16_t tmp;
	if (x >= ILI9341_Opts.Width) {
		return;
	}
	if (y >= ILI9341_Opts.Height) {
		return;
	}
	if (ILI9341_Opts.Orient == ILI9341_Orientation_Portrait_1) {
		/* Portrait1 */
		*(uint16_t *) (ILI9341_FRAME_BUFFER + ILI9341_Opts.CurrentLayerOffset + 2 * (ILI9341_PIXEL - x - ILI9341_Opts.Width * y)) = color;
	} else if (ILI9341_Opts.Orient == ILI9341_Orientation_Portrait_2) {
		/* Portrait2, original */
		*(uint16_t *) (ILI9341_FRAME_BUFFER + ILI9341_Opts.CurrentLayerOffset + 2 * (x + ILI9341_Opts.Width * y)) = color;
	} else if (ILI9341_Opts.Orient == ILI9341_Orientation_Landscape_1) {
		/* L andscape 1 */
		tmp = x;
		x = y;
		y = ILI9341_HEIGHT - 1 - tmp;
		*(uint16_t *) (ILI9341_FRAME_BUFFER + ILI9341_Opts.CurrentLayerOffset + 2 * (x + ILI9341_WIDTH * y)) = color;
	} else {
		/* Landscape2 */
		tmp = y;
		y = x;
		x = ILI9341_WIDTH - 1 - tmp;
		*(uint16_t *) (ILI9341_FRAME_BUFFER + ILI9341_Opts.CurrentLayerOffset + 2 * (x + ILI9341_WIDTH * y)) = color;
	}
	return;
}

void ILI9341_Fill(uint32_t color) {
	uint32_t i;
	uint32_t pixels = ILI9341_PIXEL * 2;
	for (i = 0; i < pixels; i += 2) {
		*(uint16_t *) (ILI9341_FRAME_BUFFER + ILI9341_Opts.CurrentLayerOffset + i) = color;
	}
}

void ILI9341_Delay(volatile unsigned int delay) {
	for (; delay != 0; delay--); 
}

void ILI9341_Rotate(ILI9341_Orientation_t orientation) {
	ILI9341_Opts.Orient = orientation;
	if (orientation == ILI9341_Orientation_Portrait_1 || orientation == ILI9341_Orientation_Portrait_2) {
		ILI9341_Opts.Width = ILI9341_WIDTH;
		ILI9341_Opts.Height = ILI9341_HEIGHT;
		ILI9341_Opts.Orientation = ILI9341_Portrait;
	} else {
		ILI9341_Opts.Width = ILI9341_HEIGHT;
		ILI9341_Opts.Height = ILI9341_WIDTH;
		ILI9341_Opts.Orientation = ILI9341_Landscape;
	}
}

void ILI9341_SetLayer1(void) {
	ILI9341_Opts.CurrentLayerOffset = 0;
	ILI9341_Opts.CurrentLayer = 0;
}

void ILI9341_SetLayer2(void) {
	ILI9341_Opts.CurrentLayerOffset = ILI9341_FRAME_OFFSET;
	ILI9341_Opts.CurrentLayer = 1;
}

void ILI9341_SetLayer1Opacity(uint8_t opacity) {
	ILI9341_Opts.Layer1Opacity = opacity;
	ILI9341_UpdateLayerOpacity();
}

void ILI9341_SetLayer2Opacity(uint8_t opacity) {
	ILI9341_Opts.Layer2Opacity = opacity;
	ILI9341_UpdateLayerOpacity();
}

void ILI9341_UpdateLayerOpacity(void) {
	LTDC_LayerAlpha(LTDC_Layer1, ILI9341_Opts.Layer1Opacity);
	LTDC_LayerAlpha(LTDC_Layer2, ILI9341_Opts.Layer2Opacity);

	/* Immidiate reload */
	LTDC_ReloadConfig(LTDC_IMReload);
}

void ILI9341_ChangeLayers(void) {
	if (ILI9341_Opts.CurrentLayer == 0) {
		ILI9341_SetLayer2();
		ILI9341_SetLayer1Opacity(0);
		ILI9341_SetLayer2Opacity(255);
	} else {
		ILI9341_SetLayer1();
		ILI9341_SetLayer1Opacity(255);
		ILI9341_SetLayer2Opacity(0);
	}
}

#include "stm32f4_dma2d_graphic.h"
void ILI9341_Layer2To1(void) {
	/* Make a memory copy */
	DMA2DGRAPHIC_CopyBuffer(
		(uint8_t *)(ILI9341_FRAME_BUFFER + ILI9341_FRAME_OFFSET), 
		(uint8_t *)(ILI9341_FRAME_BUFFER),
		240, 320, 0, 0
	);
}

void ILI9341_Layer1To2(void) {
	/* Make a memory copy */
	DMA2DGRAPHIC_CopyBuffer(
		(uint8_t *)(ILI9341_FRAME_BUFFER), 
		(uint8_t *)(ILI9341_FRAME_BUFFER + ILI9341_FRAME_OFFSET),
		240, 320, 0, 0
	);
	//memcpy((uint8_t *)(ILI9341_FRAME_BUFFER + ILI9341_FRAME_OFFSET), (uint8_t *)(ILI9341_FRAME_BUFFER), ILI9341_PIXEL * 2);
}

void ILI9341_Puts(uint16_t x, uint16_t y, char *str, FontDef_t *font, uint32_t foreground, uint32_t background) {
	uint16_t startX = x;
	
	/* Set X and Y coordinates */
	ILI9341_x = x;
	ILI9341_y = y;
	
	while (*str) {
		/* New line */
		if (*str == '\n') {
			ILI9341_y += font->FontHeight + 1;
			/* if after \n is also \r, than go to the left of the screen */
			if (*(str + 1) == '\r') {
				ILI9341_x = 0;
				str++;
			} else {
				ILI9341_x = startX;
			}
			str++;
			continue;
		} else if (*str == '\r') {
			str++;
			continue;
		}
		
		/* Put character */
		ILI9341_Putc(ILI9341_x, ILI9341_y, *str++, font, foreground, background);
	}
}

void ILI9341_GetStringSize(char *str, FontDef_t *font, uint16_t *width, uint16_t *height) {
	uint16_t w = 0;
	/* Get height */
	*height = font->FontHeight;
	/* Get length */
	while (*str++) {
		w += font->FontWidth;
	}
	/* Width */
	*width = w;
}

void ILI9341_Putc(uint16_t x, uint16_t y, char c, FontDef_t *font, uint32_t foreground, uint32_t background) {
	uint32_t i, b, j;
	/* Set coordinates */
	ILI9341_x = x;
	ILI9341_y = y;
	if ((ILI9341_x + font->FontWidth) > ILI9341_Opts.Width) {
		/* If at the end of a line of display, go to new line and set x to 0 position */
		ILI9341_y += font->FontHeight;
		ILI9341_x = 0;
	}
	for (i = 0; i < font->FontHeight; i++) {
		b = font->data[(c - 32) * font->FontHeight + i];
		for (j = 0; j < font->FontWidth; j++) {
			if ((b << j) & 0x8000) {
				ILI9341_DrawPixel(ILI9341_x + j, (ILI9341_y + i), foreground);
			} else if ((background & ILI9341_TRANSPARENT) == 0) {
				ILI9341_DrawPixel(ILI9341_x + j, (ILI9341_y + i), background);
			}
		}
	}
	/* Go to new X location */
	ILI9341_x += font->FontWidth;
}


