MoMoWan/STM32F429I-DISC1/00-Default/Utilities/stm32f4_ili9341_ltdc.c
void ILI9341_DrawLine(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint32_t color) {
	/* Code by dewoller: https://github.com/dewoller */	
	
	int16_t dx, dy, sx, sy, err, e2; 
	
	/* Check for overflow */
	if (x0 >= ILI9341_Opts.Width) {
		x0 = ILI9341_Opts.Width - 1;
	}
	if (x1 >= ILI9341_Opts.Width) {
		x1 = ILI9341_Opts.Width - 1;
	}
	if (y0 >= ILI9341_Opts.Height) {
		y0 = ILI9341_Opts.Height - 1;
	}
	if (y1 >= ILI9341_Opts.Height) {
		y1 = ILI9341_Opts.Height - 1;
	}
	
	dx = (x0 < x1) ? (x1 - x0) : (x0 - x1); 
	dy = (y0 < y1) ? (y1 - y0) : (y0 - y1); 
	sx = (x0 < x1) ? 1 : -1; 
	sy = (y0 < y1) ? 1 : -1; 
	err = ((dx > dy) ? dx : -dy) / 2; 

	while (1) {
		ILI9341_DrawPixel(x0, y0, color); 
		if (x0 == x1 && y0 == y1) {
			break;
		}
		e2 = err; 
		if (e2 > -dx) {
			err -= dy;
			x0 += sx;
		} 
		if (e2 < dy) {
			err += dx;
			y0 += sy;
		} 
	}
}


void ILI9341_DrawRectangle(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint32_t color) {
	ILI9341_DrawLine(x0, y0, x1, y0, color); /* Top */
	ILI9341_DrawLine(x0, y0, x0, y1, color);	/* Left */
	ILI9341_DrawLine(x1, y0, x1, y1, color);	/* Right */
	ILI9341_DrawLine(x0, y1, x1, y1, color);	/* Bottom */
}

void ILI9341_DrawRoundedRectangle(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t r, uint32_t color) {
	uint16_t temp;
	
	/* Check input parameters */
	if (x1 == x0 || y1 == y0) {
		return;
	}
	
	/* No radius */
	if (r == 0) {
		ILI9341_DrawRectangle(x0, y0, x1, y1, color);
	}
	
	/* Swap X coordinates */
	if (x0 > x1) {
		temp = x1;
		x1 = x0;
		x0 = temp;
	}
	
	/* Swap Y coordinates */
	if (y0 > y1) {
		temp = y1;
		y1 = y0;
		y0 = temp;
	}
	
	/* Check max radius */
	if (r > ((x1 - x0) / 2)) {
		r = (x1 - x0) / 2;
	}
	if (r > ((y1 - y0) / 2)) {
		r = (y1 - y0) / 2;
	}
	
	/* Draw lines */
	ILI9341_DrawLine(x0 + r, y0, x1 - r, y0, color); /* Top */
	ILI9341_DrawLine(x0, y0 + r, x0, y1 - r, color);	/* Left */
	ILI9341_DrawLine(x1, y0 + r, x1, y1 - r, color);	/* Right */
	ILI9341_DrawLine(x0 + r, y1, x1 - r, y1, color);	/* Bottom */
	
	/* Draw corners */
	INT_ILI9341_DrawCircleCorner(x0 + r, y0 + r, r, 0x01, color); /* Top left */
	INT_ILI9341_DrawCircleCorner(x1 - r, y0 + r, r, 0x02, color); /* Top right */
	INT_ILI9341_DrawCircleCorner(x1 - r, y1 - r, r, 0x04, color); /* Bottom right */
	INT_ILI9341_DrawCircleCorner(x0 + r, y1 - r, r, 0x08, color); /* Bottom left */
}

void ILI9341_DrawFilledRoundedRectangle(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t r, uint32_t color) {
	uint16_t temp;
	
	/* Check input parameters */
	if (x1 == x0 || y1 == y0) {
		return;
	}
	
	/* No radius */
	if (r == 0) {
		ILI9341_DrawFilledRectangle(x0, y0, x1, y1, color);
	}
	
	/* Swap X coordinates */
	if (x0 > x1) {
		temp = x1;
		x1 = x0;
		x0 = temp;
	}
	
	/* Swap Y coordinates */
	if (y0 > y1) {
		temp = y1;
		y1 = y0;
		y0 = temp;
	}
	
	/* Check max radius */
	if (r > ((x1 - x0) / 2)) {
		r = (x1 - x0) / 2;
	}
	if (r > ((y1 - y0) / 2)) {
		r = (y1 - y0) / 2;
	}
	
	/* Draw rectangles */
	ILI9341_DrawFilledRectangle(x0 + r, y0, x1 - r, y1, color);
	ILI9341_DrawFilledRectangle(x0, y0 + r, x0 + r, y1 - r, color);
	ILI9341_DrawFilledRectangle(x1 - r, y0 + r, x1, y1 - r, color);
	
	/* Draw corners */
	INT_ILI9341_DrawFilledCircleCorner(x0 + r, y0 + r, r, 0x01, color);
	INT_ILI9341_DrawFilledCircleCorner(x1 - r, y0 + r, r, 0x02, color);
	INT_ILI9341_DrawFilledCircleCorner(x1 - r, y1 - r - 1, r, 0x04, color);
	INT_ILI9341_DrawFilledCircleCorner(x0 + r, y1 - r - 1, r, 0x08, color);
}

void ILI9341_DrawFilledRectangle(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint32_t color) {
	for (; y0 <= y1; y0++) {
		ILI9341_DrawLine(x0, y0, x1, y0, color);
	}
}

void ILI9341_DrawCircle(int16_t x0, int16_t y0, int16_t r, uint32_t color) {
	int16_t f = 1 - r;
	int16_t ddF_x = 1;
	int16_t ddF_y = -2 * r;
	int16_t x = 0;
	int16_t y = r;

    ILI9341_DrawPixel(x0, y0 + r, color);
    ILI9341_DrawPixel(x0, y0 - r, color);
    ILI9341_DrawPixel(x0 + r, y0, color);
    ILI9341_DrawPixel(x0 - r, y0, color);

    while (x < y) {
        if (f >= 0) {
            y--;
            ddF_y += 2;
            f += ddF_y;
        }
        x++;
        ddF_x += 2;
        f += ddF_x;

        ILI9341_DrawPixel(x0 + x, y0 + y, color);
        ILI9341_DrawPixel(x0 - x, y0 + y, color);
        ILI9341_DrawPixel(x0 + x, y0 - y, color);
        ILI9341_DrawPixel(x0 - x, y0 - y, color);

        ILI9341_DrawPixel(x0 + y, y0 + x, color);
        ILI9341_DrawPixel(x0 - y, y0 + x, color);
        ILI9341_DrawPixel(x0 + y, y0 - x, color);
        ILI9341_DrawPixel(x0 - y, y0 - x, color);
    }
}

void ILI9341_DrawFilledCircle(int16_t x0, int16_t y0, int16_t r, uint32_t color) {
	int16_t f = 1 - r;
	int16_t ddF_x = 1;
	int16_t ddF_y = -2 * r;
	int16_t x = 0;
	int16_t y = r;

    ILI9341_DrawPixel(x0, y0 + r, color);
    ILI9341_DrawPixel(x0, y0 - r, color);
    ILI9341_DrawPixel(x0 + r, y0, color);
    ILI9341_DrawPixel(x0 - r, y0, color);
    ILI9341_DrawLine(x0 - r, y0, x0 + r, y0, color);

    while (x < y) {
        if (f >= 0) {
            y--;
            ddF_y += 2;
            f += ddF_y;
        }
        x++;
        ddF_x += 2;
        f += ddF_x;

        ILI9341_DrawLine(x0 - x, y0 + y, x0 + x, y0 + y, color);
        ILI9341_DrawLine(x0 + x, y0 - y, x0 - x, y0 - y, color);

        ILI9341_DrawLine(x0 + y, y0 + x, x0 - y, y0 + x, color);
        ILI9341_DrawLine(x0 + y, y0 - x, x0 - y, y0 - x, color);
    }
}

/* Internal functions */
void INT_ILI9341_DrawCircleCorner(int16_t x0, int16_t y0, int16_t r, uint8_t corner, uint32_t color) {
	int16_t f = 1 - r;
	int16_t ddF_x = 1;
	int16_t ddF_y = -2 * r;
	int16_t x = 0;
	int16_t y = r;

    while (x < y) {
        if (f >= 0) {
            y--;
            ddF_y += 2;
            f += ddF_y;
        }
        x++;
        ddF_x += 2;
        f += ddF_x;

        if (corner & 0x01) {	
			ILI9341_DrawPixel(x0 - y, y0 - x, color);
			ILI9341_DrawPixel(x0 - x, y0 - y, color);
		}
		
        if (corner & 0x02) {	
			ILI9341_DrawPixel(x0 + x, y0 - y, color);
			ILI9341_DrawPixel(x0 + y, y0 - x, color);
		}
		
		if (corner & 0x04) {	
			ILI9341_DrawPixel(x0 + x, y0 + y, color);
			ILI9341_DrawPixel(x0 + y, y0 + x, color);
		}
		
        if (corner & 0x08) {	
			ILI9341_DrawPixel(x0 - x, y0 + y, color);
			ILI9341_DrawPixel(x0 - y, y0 + x, color);
		}
    }
}

void INT_ILI9341_DrawFilledCircleCorner(int16_t x0, int16_t y0, int16_t r, uint8_t corner, uint32_t color) {
	int16_t f = 1 - r;
	int16_t ddF_x = 1;
	int16_t ddF_y = -2 * r;
	int16_t x = 0;
	int16_t y = r;

    while (x < y) {
        if (f >= 0) {
            y--;
            ddF_y += 2;
            f += ddF_y;
        }
        x++;
        ddF_x += 2;
        f += ddF_x;

        if (corner & 0x01) {
			ILI9341_DrawLine(x0, y0 - y, x0 - x, y0 - y, color);
			ILI9341_DrawLine(x0, y0 - x, x0 - y, y0 - x, color);
		}
		
        if (corner & 0x02) {	
			ILI9341_DrawLine(x0 + x, y0 - y, x0, y0 - y, color);
			ILI9341_DrawLine(x0 + y, y0 - x, x0, y0 - x, color);
		}
		
		if (corner & 0x04) {
			ILI9341_DrawLine(x0, y0 + y, x0 + x, y0 + y, color);
			ILI9341_DrawLine(x0 + y, y0 + x, x0, y0 + x, color);
		}
		
        if (corner & 0x08) {
			ILI9341_DrawLine(x0 - x, y0 + y, x0, y0 + y, color);
			ILI9341_DrawLine(x0, y0 + x, x0 - y, y0 + x, color);
		}
    }
}

